TRIGGERS = {'зефир', 'сфер', 'эфир', 'зефира', 'зверь', 'сефер'}

FUNCS={'offBot','get_weather', 'time', 'offpc'}
APPS={'telegram', 'calc', 'game', 'excel', 'paint', 'powerpoint', 'terminal', 'word', 'settings', 'calendar', 'notebook', 'photo', 'camera', 'watch'}
WEB_SITES={'browser', 'mail', 'youtube', 'vk', 'kinopoisk', 'yandexmusic', 'wikipedia', 'ok', 'google', 'rambler', 'avito', 'gismeteo', 'ozon', 'rbc', 'yandexmarket', 'gosuslugi', 'yandexeda', 'googletranslate'}

SPEAKERS={'get_weather', 'time'}

INTENTS = {
    "hello": {
        "examples": ["привет", "приветик", "приветики", "здравствуйте", "здравствуй", "приветствую", "доброе утро", "добрый день", "добрый вечер"],
        "responses": ["привет", "здравствуйте"],
    },
    "offBot": {
        "examples": ["пока", "отключись", "до свидания", "до встречи", "прощай", "прощайте", "выключись", "отключайся", "выключайся", "заверши работу"],
        "responses": ["пока", "отключаюсь", "до свидания", "до встречи"],
    },
    "how_are_you": {
        "examples": ["как у тебя дела", "как твои дела" "как ты", "как твоё настроение", "как жизнь", "как день"],
        "responses": ["всё хорошо спасибо", "лучше всех", "нормально", "отлично"],
    },
    "thanks": {
        "examples": ["спасибо", "благодарю", "я тебе благодарна", "я тебе благодарен", "большое спасибо"],
        "responses": ["пожалуйста", "обращайтесь", "обращайся", "всегда рада помочь", "рада помочь"],
    },
    "get_weather": {
        "examples": ["погода","какая погода", "сколько градусов", "какая погода на улице", "что с погодой", "сколько градусов на улице", "что там на улице", "какая сегодня погода", "подскажи погоду", "подскажи сколько градусов", "подскажи какая сегодня погода"],
        "responses": ["сейчас посмотрю", "сейчас гляну", "сейчас проверю"],
    },
    "browser": {
        "examples": ["открой браузер", "запусти браузер", "интернет", "открой новую вкладку в браузере", "открой интернет", "запусти интернет", "открой новую вкладку" ],
        "responses": ["открываю браузер"],
    },
    "game": {
        "examples": ["играть", "хочу играть", "включи игру", "игра", "хочу поиграть", "запусти игру"],
        "responses": ["включаю игру"],
    },
    "offpc": {
        "examples": ["выключи компьютер", "отключи компьютер", "отруби комп", "выключи комп", "отключи комп"],
        "responses": ["отключаю компьютер"],
    },
    "here": {
        "examples": ["ты тут", "ты здесь", "здесь", "ты где"],
        "responses": ["я тут", "я здесь"],
    },
    "work": {
        "examples": ["ты работаешь"],
        "responses": ["ещё как"],
    },
    "joke": {
        "examples": ["расскажи анектод", "анекдот", "пошути", "расскажи шутку", "рассмеши меня"],
        "responses": [f"А правда, что кошки и дрессировка несовместимы?\nНет, мой кот выдрессировал меня за три дня!", f"Народная мудрость гласит:\nодежду надо покупать под цвет шерсти своего кота.", f"Вчера решил посадить кошку на диету,\nа то она слишком толстая стала.\nСегодня она родила.\nА на что ты готов ради еды?"],
    },
    "telegram": {
        "examples": ["открой телеграмм", "запусти телеграмм", "открой телегу", "запусти телегу"],
        "responses": ["открываю телеграмм"],
    },
    "calc": {
        "examples": ["открой калькулятор", "запусти калькулятор", "надо посчитать"],
        "responses": ["запускаю калькулятор"],
    },
    "time": {
        "examples": ["время", "сколько времени", "сколько часов"],
        "responses": [""],
    },
    "mail": {
        "examples": ["открой почту", "хочу проверить почту", "письма", "хочу почитать письма", "хочу почитать почту"],
        "responses": ["открываю почту"],
    },
    "skills": {
        "examples": ["что ты умеешь", "что ты можешь", "твой функционал", "расскажи что ты умеешь", "расскажи что ты можешь"],
        "responses": ["Я умею узнавать погоду и время,\nоткрывать программы и сайты,\nотключать компьютер и рассказывать анектоды"],
    },
    "excel": {
        "examples": ["открой эксель", "запусти эксель", "открой иксель",  "открой иксэль", "запусти иксэль"],
        "responses": ["запускаю эксэль"],
    },
    "paint": {
        "examples": ["открой пэйнт", "запусти пэйнт"],
        "responses": ["запускаю пэйнт"],
    },
    "powerpoint": {
        "examples": ["открой повар поинт", "лавр поинт", "запусти повар понт", "открой павр поинт", "нужно сделать презентацию", "открой презентацию"],
        "responses": ["запускаю павер поинт"],
    },
    "terminal": {
        "examples": ["открой терминал", "запусти терминал", "открой командную строку"],
        "responses": ["запускаю терминал"],
    },
    "word": {
        "examples": ["открой ворд", "запусти борт", "открой ворт", "открой горд", "запусти ворлд", "открой ворота"],
        "responses": ["запускаю ворд"],
    },
    "settings": {
        "examples": ["открой настройки", "запусти параметры", "запусти настройки", "открой параметры"],
        "responses": ["открываю параметры"],
    },
    "calendar": {
        "examples": ["открой календарь", "запусти календарь"],
        "responses": ["открываю календарь"],
    },
    "notebook": {
        "examples": ["открой блокнот", "запусти блокнот"],
        "responses": ["открываю блокнот"],
    },
    "photo": {
        "examples": ["открой галерею", "запусти фотографии", "хочу посмотреть фотографии", "хочу посмотреть фотки", "открой фотографии"],
        "responses": ["открываю фотографии"],
    },
    "camera": {
        "examples": ["открой камеру", "запусти камеру","как я выгляжу"],
        "responses": ["открываю камеру"],
    },
    "watch": {
        "examples": ["открой часы", "запусти часы"],
        "responses": ["открываю часы"],
    },
    "youtube": {
        "examples": ["открой ютуб", "запусти ютюб", "зайди в ютуб"],
        "responses": ["открываю ютуб"],
    },
    "vk": {
        "examples": ["открой быка", "запусти века", "открой контакт", "запусти вконтакте", "зайди в контакт", "зайди в вака"],
        "responses": ["открываю вконтакте"],
    },
    "kinopoisk": {
        "examples": ["открой кинопоиск", "запусти кинопоиск", "хочу посмотреть кино", "глянуть фильм", "зайди на кинопоиск"],
        "responses": ["открываю кинопоиск"],
    },
    "yandexmusic": {
        "examples": ["открой яндекс музыку", "запусти музыку на яндексе", "зайди на яндекс музыку", "музыка", "включи музыку", "хочу послушать музыку", "хочу потанцевать"],
        "responses": ["открываю яндекс музыку"],
    },
    "wikipedia": {
        "examples": ["открой википидию", "запусти векипедию", "википедия", "зайди на википедию"],
        "responses": ["открываю википедию"],
    },
    "ok": {
        "examples": ["открой одноклассники", "запусти одноклассники", "зайди на одноклассники"],
        "responses": ["открываю одноклассники"],
    },
    "google": {
        "examples": ["открой гугл", "запусти гугл", "зайди в губы"],
        "responses": ["открываю гугл"],
    },
    "rambler": {
        "examples": ["открой рамблер", "запусти рамблер", "зайди в рамблер"],
        "responses": ["открываю рамблер"],
    },
    "avito": {
        "examples": ["открой авито", "запусти авито", "зайди в вито", "зайди в элита"],
        "responses": ["открываю авито"],
    },
    "gismeteo": {
        "examples": ["открой гисметео", "запусти гисметео", "зайди в гисметео", "покажи погоду на гисметео"],
        "responses": ["открываю гисметео"],
    },
    "ozon": {
        "examples": ["открой озон", "запусти озон", "зайди в озон", "надо сделать заказ на зоне", "заказ позвони"],
        "responses": ["открываю озон"],
    },
    "rbc": {
        "examples": ["открой рбк", "зайди в рбк"],
        "responses": ["открываю эр бэ ка"],
    },
    "yandexmarket": {
        "examples": ["открой яндекс маркет", "зайди в яндекс маркет "],
        "responses": ["открываю яндекс маркет"],
    },
    "gosuslugi": {
        "examples": ["открой госуслуги", "зайди в госуслуги "],
        "responses": ["открываю госуслуги"],
    },
    "yandexeda": {
        "examples": ["открой яндекс еду", "зайди в яндкс еду", "хочу кушать", "хочу есть"],
        "responses": ["открываю яндекс еду"],
    },
    "googletranslate": {
        "examples": ["открой гугл переводчик", "зайди в губы переводчик", "надо перевести", "нужно перевести", "переведи", "перевод"],
        "responses": ["открываю гугл переводчик"],
    },
}